[Killed] BlockStatement
Jest/challenge-2/src/asyncActions.js:5:17
 
 const asyncActions = {
   url: `http://localhost:3005/comments`,
-  fetchData(url){
-    return fetch(url)
-      .then(response => response.json())
-      .catch(error => error)
-  },
+  fetchData(url){},
   fetchAndStore(url){
     return this.fetchData(url)

[Killed] ArrowFunction
Jest/challenge-2/src/asyncActions.js:7:13
   url: `http://localhost:3005/comments`,
   fetchData(url){
     return fetch(url)
-      .then(response => response.json())
+      .then(() => undefined)
       .catch(error => error)
   },

[Killed] ArrowFunction
Jest/challenge-2/src/asyncActions.js:8:14
   fetchData(url){
     return fetch(url)
       .then(response => response.json())
-      .catch(error => error)
+      .catch(() => undefined)
   },
   fetchAndStore(url){

[Killed] BlockStatement
Jest/challenge-2/src/asyncActions.js:10:21
       .then(response => response.json())
       .catch(error => error)
   },
-  fetchAndStore(url){
-    return this.fetchData(url)
-      .then(this.saveToLocalStorage)
-      .catch(error => error);
-  },
+  fetchAndStore(url){},
   saveToLocalStorage(data){
     console.log('comments', JSON.stringify(data));

[Killed] ArrowFunction
Jest/challenge-2/src/asyncActions.js:13:14
   fetchAndStore(url){
     return this.fetchData(url)
       .then(this.saveToLocalStorage)
-      .catch(error => error);
+      .catch(() => undefined);
   },
   saveToLocalStorage(data){

[Killed] BlockStatement
Jest/challenge-2/src/asyncActions.js:15:27
       .then(this.saveToLocalStorage)
       .catch(error => error);
   },
-  saveToLocalStorage(data){
-    console.log('comments', JSON.stringify(data));
-  }
+  saveToLocalStorage(data){}
 }
 
