[Killed] ObjectLiteral
Jest/challenge-2/src/asyncMockActions.js:3:26
 require('isomorphic-fetch');
 
-const asyncMockActions = {
-  url: `http://localhost:3005/comments`,
-  fetchData(url){
-    return fetch(url)
-      .then(response => response.json())
-      .catch(error => error)
-  }
-}
+const asyncMockActions = {}
 
 module.exports = asyncMockActions;

[Killed] BlockStatement
Jest/challenge-2/src/asyncMockActions.js:5:17
 
 const asyncMockActions = {
   url: `http://localhost:3005/comments`,
-  fetchData(url){
-    return fetch(url)
-      .then(response => response.json())
-      .catch(error => error)
-  }
+  fetchData(url){}
 }
 
