[Killed] BlockStatement
Jest/challenge-2/src/timerActions.js:2:24
 const timerActions = {
-  withTimeout(callback){
-    const delay = 1000;
-    console.log('We in sync bois!');
-    setTimeout(() => {
-      console.log('Where are we now?');
-      callback && callback();
-    }, delay);
-  }
+  withTimeout(callback){}
 }
 

[Killed] BlockStatement
Jest/challenge-2/src/timerActions.js:5:22
   withTimeout(callback){
     const delay = 1000;
     console.log('We in sync bois!');
-    setTimeout(() => {
-      console.log('Where are we now?');
-      callback && callback();
-    }, delay);
+    setTimeout(() => {}, delay);
   }
 }

[Killed] StringLiteral
Jest/challenge-2/src/timerActions.js:6:19
     const delay = 1000;
     console.log('We in sync bois!');
     setTimeout(() => {
-      console.log('Where are we now?');
+      console.log("");
       callback && callback();
     }, delay);

[Killed] ConditionalExpression
Jest/challenge-2/src/timerActions.js:7:7
     console.log('We in sync bois!');
     setTimeout(() => {
       console.log('Where are we now?');
-      callback && callback();
+      true;
     }, delay);
   }

[Killed] ConditionalExpression
Jest/challenge-2/src/timerActions.js:7:7
     console.log('We in sync bois!');
     setTimeout(() => {
       console.log('Where are we now?');
-      callback && callback();
+      false;
     }, delay);
   }
